valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_LEN (4u)

/** \brief Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_OFF (0u)

/** \brief Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_LEN (4u)

/** \brief Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_LEN (6u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_MSK (0x3fu)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_OFF (0u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_OFF (14u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_OFF (15u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_LEN (6u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_MSK (0x3fu)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_OFF (16u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_OFF (24u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_OFF (31u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_OFF (18u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_OFF (28u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_OFF (30u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_OFF (31u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_OFF (3u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_OFF (7u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_LEN (2u)

