valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.FEN */
#define IFX_EVADC_G_RCR_FEN_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RCR_Bits.SRGEN */
#define IFX_EVADC_G_RCR_SRGEN_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.RESULT */
#define IFX_EVADC_G_RES_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.DRC */
#define IFX_EVADC_G_RES_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CHNR */
#define IFX_EVADC_G_RES_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.EMUX */
#define IFX_EVADC_G_RES_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.CRS */
#define IFX_EVADC_G_RES_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RES_Bits.VF */
#define IFX_EVADC_G_RES_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.RESULT */
#define IFX_EVADC_G_RESD_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.DRC */
#define IFX_EVADC_G_RESD_DRC_OFF (16u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CHNR */
#define IFX_EVADC_G_RESD_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.EMUX */
#define IFX_EVADC_G_RESD_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.CRS */
#define IFX_EVADC_G_RESD_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_RESD_Bits.VF */
#define IFX_EVADC_G_RESD_VF_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEVADC_BF_H */
